; domain
(define (domain blocksworld-domain)
 (:requirements :strips :typing :constraints :action-costs)
 (:types block)
 (:predicates (clear ?obj - block) (ontable ?obj - block) (handempty) (holding ?obj - block) (on ?obj1 - block ?obj2 - block))
 (:functions (total-cost))
 (:action pickup
  :parameters ( ?obj - block)
  :precondition (and (clear ?obj) (ontable ?obj) (handempty))
  :effect (and (holding ?obj) (not (clear ?obj)) (not (ontable ?obj)) (not (handempty)) (increase (total-cost) 1)))
 (:action putdown
  :parameters ( ?obj - block)
  :precondition (and (holding ?obj))
  :effect (and (clear ?obj) (handempty) (ontable ?obj) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action stack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (clear ?underobj) (holding ?obj))
  :effect (and (handempty) (clear ?obj) (on ?obj ?underobj) (not (clear ?underobj)) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action unstack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (on ?obj ?underobj) (clear ?obj) (handempty))
  :effect (and (holding ?obj) (clear ?underobj) (not (on ?obj ?underobj)) (not (clear ?obj)) (not (handempty)) (increase (total-cost) 1)))
)

; problem
(define (problem blocksworld-problem)
 (:domain blocksworld-domain)
 (:objects
   green_block_1 grey_block_1 grey_block_2 orange_block_1 black_block_1 black_block_2 brown_block_1 - block
 )
 (:init (ontable green_block_1) (ontable grey_block_1) (on grey_block_2 green_block_1) (on orange_block_1 grey_block_1) (on black_block_1 grey_block_2) (ontable black_block_2) (on brown_block_1 orange_block_1) (clear black_block_1) (clear black_block_2) (clear brown_block_1) (handempty) (= (total-cost) 0))
 (:goal (and (holding green_block_1)))
 (:constraints (sometime (and (holding orange_block_1) (not (clear black_block_2)))) (sometime (not (clear black_block_1))) (sometime-before (not (clear black_block_1)) (or (ontable brown_block_1) (not (ontable grey_block_1)))) (always (not (ontable black_block_1))) (sometime (on grey_block_2 green_block_1)) (sometime-after (on grey_block_2 green_block_1) (on grey_block_2 black_block_2)) (always (not (ontable grey_block_2))) (sometime (not (on grey_block_2 orange_block_1))) (sometime-after (not (on grey_block_2 orange_block_1)) (on brown_block_1 grey_block_2)) (sometime (or (ontable brown_block_1) (holding grey_block_1))) (sometime (and (not (clear brown_block_1)) (on orange_block_1 black_block_2))) (sometime (clear green_block_1)) (sometime-before (clear green_block_1) (or (clear orange_block_1) (ontable brown_block_1))) (sometime (clear grey_block_1)))
 (:metric minimize (total-cost))
)

; plan
1. (unstack brown_block_1 orange_block_1)
   deleted: (on brown_block_1 orange_block_1) (clear brown_block_1) (handempty)
   added: (holding brown_block_1) (clear orange_block_1)
   goals met: 0 of 1
2. (putdown brown_block_1)
   deleted: (holding brown_block_1)
   added: (clear brown_block_1) (handempty) (ontable brown_block_1)
   goals met: 0 of 1
3. (unstack orange_block_1 grey_block_1)
   deleted: (on orange_block_1 grey_block_1) (clear orange_block_1) (handempty)
   added: (holding orange_block_1) (clear grey_block_1)
   goals met: 0 of 1
4. (stack orange_block_1 black_block_2)
   deleted: (clear black_block_2) (holding orange_block_1)
   added: (handempty) (clear orange_block_1) (on orange_block_1 black_block_2)
   goals met: 0 of 1
5. (unstack black_block_1 grey_block_2)
   deleted: (on black_block_1 grey_block_2) (clear black_block_1) (handempty)
   added: (holding black_block_1) (clear grey_block_2)
   goals met: 0 of 1
6. (stack black_block_1 grey_block_1)
   deleted: (clear grey_block_1) (holding black_block_1)
   added: (handempty) (clear black_block_1) (on black_block_1 grey_block_1)
   goals met: 0 of 1
7. (unstack grey_block_2 green_block_1)
   deleted: (on grey_block_2 green_block_1) (clear grey_block_2) (handempty)
   added: (holding grey_block_2) (clear green_block_1)
   goals met: 0 of 1
8. (stack grey_block_2 brown_block_1)
   deleted: (clear brown_block_1) (holding grey_block_2)
   added: (handempty) (clear grey_block_2) (on grey_block_2 brown_block_1)
   goals met: 0 of 1
9. (unstack orange_block_1 black_block_2)
   deleted: (on orange_block_1 black_block_2) (clear orange_block_1) (handempty)
   added: (holding orange_block_1) (clear black_block_2)
   goals met: 0 of 1
10. (stack orange_block_1 green_block_1)
   deleted: (clear green_block_1) (holding orange_block_1)
   added: (handempty) (clear orange_block_1) (on orange_block_1 green_block_1)
   goals met: 0 of 1
11. (unstack grey_block_2 brown_block_1)
   deleted: (on grey_block_2 brown_block_1) (clear grey_block_2) (handempty)
   added: (holding grey_block_2) (clear brown_block_1)
   goals met: 0 of 1
12. (stack grey_block_2 black_block_2)
   deleted: (clear black_block_2) (holding grey_block_2)
   added: (handempty) (clear grey_block_2) (on grey_block_2 black_block_2)
   goals met: 0 of 1
13. (pickup brown_block_1)
   deleted: (clear brown_block_1) (ontable brown_block_1) (handempty)
   added: (holding brown_block_1)
   goals met: 0 of 1
14. (stack brown_block_1 grey_block_2)
   deleted: (clear grey_block_2) (holding brown_block_1)
   added: (handempty) (clear brown_block_1) (on brown_block_1 grey_block_2)
   goals met: 0 of 1
15. (unstack orange_block_1 green_block_1)
   deleted: (on orange_block_1 green_block_1) (clear orange_block_1) (handempty)
   added: (holding orange_block_1) (clear green_block_1)
   goals met: 0 of 1
16. (putdown orange_block_1)
   deleted: (holding orange_block_1)
   added: (clear orange_block_1) (handempty) (ontable orange_block_1)
   goals met: 0 of 1
17. (pickup green_block_1)
   deleted: (clear green_block_1) (ontable green_block_1) (handempty)
   added: (holding green_block_1)
   goals met: 1 of 1
